service-email-egress/egress-balancer/ews_move_payload.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"
               xmlns:t="http://schemas.microsoft.com/exchange/services/2006/types"
               xmlns:m="http://schemas.microsoft.com/exchange/services/2006/messages">
  <soap:Header>
    <t:RequestServerVersion Version="Exchange2016" />
    <t:ExchangeImpersonation>
      <t:ConnectingSID><t:PrimarySmtpAddress>peter@woodfinegroup.com</t:PrimarySmtpAddress></t:ConnectingSID>
    </t:ExchangeImpersonation>
  </soap:Header>
  <soap:Body>
    <m:MoveItem>
      <m:ToFolderId>
        <t:DistinguishedFolderId Id="archivemsgfolderroot" />
      </m:ToFolderId>
      <m:ItemIds>
        <t:ItemId Id="AAMkADVkZGE2MTEzLWFiMGEtNGZiMS1iNjU5LWI2ZjgxNjI3OGYwMwBGAAAAAADwv6aPuXUhRZGdC5GlOwN1BwD4ZMQx5VnyS6YsK9NKxalrAAAAAAEJAAC46zuTLuLnRb1tE77lqpupAAgpQFTTAAA=" />
      </m:ItemIds>
    </m:MoveItem>
  </soap:Body>
</soap:Envelope>
